
create_clock -period 10.000 -name i_riscv_core_clk -waveform {0.000 5.000} [get_ports i_riscv_core_clk]
set_input_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay 0.500 [get_ports {i_riscv_core_imem_data_out[*]}]
set_input_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports {i_riscv_core_imem_data_out[*]}]
set_input_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay 0.500 [get_ports {i_riscv_core_mem_data_out[*]}]
set_input_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports {i_riscv_core_mem_data_out[*]}]
set_input_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay 0.500 [get_ports i_riscv_core_external_interrupt]
set_input_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports i_riscv_core_external_interrupt]
set_input_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay 0.500 [get_ports i_riscv_core_imem_ready]
set_input_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports i_riscv_core_imem_ready]
set_input_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay 0.500 [get_ports i_riscv_core_mem_ready]
set_input_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports i_riscv_core_mem_ready]
set_input_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay 0.500 [get_ports i_riscv_core_rst]
set_input_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports i_riscv_core_rst]
set_output_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay -0.500 [get_ports {o_riscv_core_cache_data_out[*]}]
set_output_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports {o_riscv_core_cache_data_out[*]}]
set_output_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay -0.500 [get_ports {o_riscv_core_icache_data_out[*]}]
set_output_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports {o_riscv_core_icache_data_out[*]}]
set_output_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay -0.500 [get_ports {o_riscv_core_imem_addr[*]}]
set_output_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports {o_riscv_core_imem_addr[*]}]
set_output_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay -0.500 [get_ports {o_riscv_core_mem_addr[*]}]
set_output_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports {o_riscv_core_mem_addr[*]}]
set_output_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay -0.500 [get_ports o_riscv_core_fsm_imem_rden]
set_output_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports o_riscv_core_fsm_imem_rden]
set_output_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay -0.500 [get_ports o_riscv_core_fsm_mem_rden]
set_output_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports o_riscv_core_fsm_mem_rden]
set_output_delay -clock [get_clocks i_riscv_core_clk] -min -add_delay -0.500 [get_ports o_riscv_core_fsm_mem_wren]
set_output_delay -clock [get_clocks i_riscv_core_clk] -max -add_delay 2.000 [get_ports o_riscv_core_fsm_mem_wren]
